Revit 2024 API
CurtainSystem.AddCurtainGrid Method
Add CurtainGrid on the specified face for the CurtainSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void AddCurtainGrid(
	Reference face
)
Visual Basic
Public Sub AddCurtainGrid ( _
	face As Reference _
)
Visual C++
public:
void AddCurtainGrid(
	Reference^ face
)
Parameters
face
Type: Autodesk.Revit.DB.Reference
The face new CurtainGrid will be created on.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input argument face is null.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when creating CurtainGrid on the specified face fails or regenerate fails.
See Also
CurtainSystem Class
Autodesk.Revit.DB Namespace